title: Suspicious Scheduled Task Registration
id: 10a4fb8c-29d5-4eb6-905f-13d6a553d470
status: experimental
description: Detects the creation of new Windows scheduled tasks, which attackers often use for persistence.
author: Elad Levi
date: 2025/05/07
modified: 2025/05/07
level: low
tags:
  - attack.persistence
  - attack.T1053.005
logsource:
  product: windows
  service: task_scheduler
falsepositives:
  - Legitimate administrative automation tasks (e.g., backups, updates)
  - System provisioning or patch-management frameworks
references:
  - https://docs.microsoft.com/windows/winlogon/event-106-microsoft-windows-taskscheduler
  - https://attack.mitre.org/techniques/T1053/005/
  - https://docs.nxlog.co/integrate/windows-task-scheduler.html
  - https://github.com/woanware/simple-evtx/blob/master/evtx/Maps/Microsoft-Windows-TaskScheduler_Operational_106.map
  - https://redcanary.com/threat-detection-report/techniques/scheduled-task/
  - https://www.binarydefense.com/resources/blog/diving-into-hidden-scheduled-tasks/
detection:
    task_scheduler_channel:
        - source_name: Microsoft-Windows-TaskScheduler
    task_created_event_id:
        - event_identifier: 106
    condition: task_scheduler_channel and task_created_event_id
